tests/loadtesting/local_waf_out
> oha -n 10000 -c 200 "https://ddns.eipc.store:19191/?q=1+union+select"
Summary:
  Success rate:	100.00%
  Total:	366.9640 ms
  Slowest:	204.0949 ms
  Fastest:	0.0614 ms
  Average:	6.6984 ms
  Requests/sec:	27250.6306

  Total data:	175.78 KiB
  Size/request:	18 B
  Size/sec:	479.01 KiB

Response time histogram:
    0.061 ms [1]    |
   20.465 ms [9799] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   40.868 ms [0]    |
   61.271 ms [0]    |
   81.675 ms [0]    |
  102.078 ms [0]    |
  122.481 ms [19]   |
  142.885 ms [3]    |
  163.288 ms [68]   |
  183.692 ms [71]   |
  204.095 ms [39]   |

Response time distribution:
  10.00% in 1.7010 ms
  25.00% in 2.6418 ms
  50.00% in 3.4647 ms
  75.00% in 4.4059 ms
  90.00% in 5.6921 ms
  95.00% in 6.7719 ms
  99.00% in 166.9706 ms
  99.90% in 194.9616 ms
  99.99% in 202.3045 ms


Details (average, fastest, slowest):
  DNS+dialup:	95.5180 ms, 22.5870 ms, 154.0605 ms
  DNS-lookup:	0.0064 ms, 0.0041 ms, 0.0435 ms

Status code distribution:
  [403] 10000 responses