tests/loadtesting/local_waf_pass
[root@Windows shibaiman]# oha -n 100000 -c 200 https://ddns.eipc.store:19191
Summary:
  Success rate:	100.00%
  Total:	12265.7335 ms
  Slowest:	267.4497 ms
  Fastest:	0.3572 ms
  Average:	24.4493 ms
  Requests/sec:	8152.7941

  Total data:	36.62 MiB
  Size/request:	384 B
  Size/sec:	2.99 MiB

Response time histogram:
    0.357 ms [1]     |
   27.066 ms [63465] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   53.776 ms [23328] |■■■■■■■■■■■
   80.485 ms [9583]  |■■■■
  107.194 ms [2479]  |■
  133.903 ms [699]   |
  160.613 ms [234]   |
  187.322 ms [128]   |
  214.031 ms [56]    |
  240.740 ms [25]    |
  267.450 ms [2]     |

Response time distribution:
  10.00% in 2.7687 ms
  25.00% in 4.7869 ms
  50.00% in 11.1727 ms
  75.00% in 41.3952 ms
  90.00% in 58.7961 ms
  95.00% in 73.3583 ms
  99.00% in 111.4181 ms
  99.90% in 180.0735 ms
  99.99% in 224.3583 ms


Details (average, fastest, slowest):
  DNS+dialup:	95.3366 ms, 13.7568 ms, 170.8752 ms
  DNS-lookup:	0.0062 ms, 0.0038 ms, 0.0323 ms

Status code distribution:
  [200] 100000 responses